# IsBeforeEndDateAndTime Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..IsBeforeEndDateAndTime Method
SunAndShadowSettings Class See Also
---
Checks whether the start date and time is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsBeforeEndDateAndTime(
	DateTime time
)
```

Visual Basic
---
```text
Public Function IsBeforeEndDateAndTime ( _
	time As DateTime _
) As Boolean
```

Visual C++
---
```text
public:
bool IsBeforeEndDateAndTime(
	DateTime time
)
```

# ### Parameters
time
    Type: System..::..DateTime Date and time value
# ### Return Value
True if the date and time is valid, false otherwise.
# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace